backend/SISNET/extracted/ejemplos/ejemplos/recepcionCFE.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.sitioWeb.crp.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:recepcionCFE>
         <!--Optional:-->
         <wsCAE>
            <!--Optional:-->
            <errorDes>?</errorDes>
            <!--Optional:-->
            <hayError>?</hayError>
            <!--Optional:-->
            <idInterno>?</idInterno>
            <!--Optional:-->
            <numero>?</numero>
            <!--Optional:-->
            <numeroAutorizacion>?</numeroAutorizacion>
            <!--Optional:-->
            <serie>?</serie>
         </wsCAE>
         <!--Optional:-->
         <wsVarios>
            <!--Optional:-->
            <clauVenta>?</clauVenta>
            <!--Optional:-->
            <fchEmis>?</fchEmis>
            <!--Optional:-->
            <fchVenc>?</fchVenc>
            <!--Optional:-->
            <fdesdeServicio>?</fdesdeServicio>
            <!--Optional:-->
            <fhastaServicio>?</fhastaServicio>
            <!--Optional:-->
            <fmaPago>?</fmaPago>
            <!--Optional:-->
            <infoAdicionalDoc>?</infoAdicionalDoc>
            <!--Optional:-->
            <infoAdicionalEmisor>?</infoAdicionalEmisor>
            <!--Optional:-->
            <mntBruto>?</mntBruto>
            <!--Optional:-->
            <modVenta>?</modVenta>
            <!--Optional:-->
            <tipoTraslado>?</tipoTraslado>
            <!--Optional:-->
            <viaTransp>?</viaTransp>
         </wsVarios>
         <!--Optional:-->
         <wsReceptor>
            <!--Optional:-->
            <ciudadRecep>?</ciudadRecep>
            <!--Optional:-->
            <codPaisRecep>?</codPaisRecep>
            <!--Optional:-->
            <codpostalrecep>?</codpostalrecep>
            <!--Optional:-->
            <deptoRecep>?</deptoRecep>
            <!--Optional:-->
            <dirRecep>?</dirRecep>
            <!--Optional:-->
            <docRecep>?</docRecep>
            <!--Optional:-->
            <infoAdicional>?</infoAdicional>
            <!--Optional:-->
            <lugardestentrecep>?</lugardestentrecep>
            <!--Optional:-->
            <nroidcompra>?</nroidcompra>
            <!--Optional:-->
            <rznSocRecep>?</rznSocRecep>
            <!--Optional:-->
            <tipoDocRecep>?</tipoDocRecep>
         </wsReceptor>
         <!--Optional:-->
         <wsTotales>
            <cantLinDet>?</cantLinDet>
            <!--Optional:-->
            <mntExpoyAsim>?</mntExpoyAsim>
            <!--Optional:-->
            <mntIVAOtra>?</mntIVAOtra>
            <!--Optional:-->
            <mntIVATasaBas>?</mntIVATasaBas>
            <!--Optional:-->
            <mntIVATasaMin>?</mntIVATasaMin>
            <!--Optional:-->
            <mntImpPerc>?</mntImpPerc>
            <!--Optional:-->
            <mntIvaSuspenso>?</mntIvaSuspenso>
            <!--Optional:-->
            <mntNetoIVAOtra>?</mntNetoIVAOtra>
            <!--Optional:-->
            <mntNetoIvaSuspenso>?</mntNetoIvaSuspenso>
            <!--Optional:-->
            <mntNetoIvaTasaBasica>?</mntNetoIvaTasaBasica>
            <!--Optional:-->
            <mntNetoIvaTasaMin>?</mntNetoIvaTasaMin>
            <!--Optional:-->
            <mntNoGrv>?</mntNoGrv>
            <!--Optional:-->
            <mntPagar>?</mntPagar>
            <!--Optional:-->
            <mntTotCredFisc>?</mntTotCredFisc>
            <!--Optional:-->
            <mntTotRetenido>?</mntTotRetenido>
            <!--Optional:-->
            <mntTotal>?</mntTotal>
            <!--Optional:-->
            <montoNF>?</montoNF>
            <!--Optional:-->
            <tpoCambio>?</tpoCambio>
            <!--Optional:-->
            <tpoMoneda>?</tpoMoneda>
            <!--Optional:-->
            <iVATasaBas>?</iVATasaBas>
            <!--Optional:-->
            <iVATasaMin>?</iVATasaMin>
         </wsTotales>
         <!--Zero or more repetitions:-->
         <listaWsItems>
            <!--Optional:-->
            <cantidad>?</cantidad>
            <!--Optional:-->
            <cod>?</cod>
            <!--Optional:-->
            <codtipo>?</codtipo>
            <!--Optional:-->
            <descAdicional>?</descAdicional>
            <!--Optional:-->
            <descuentoMonto>?</descuentoMonto>
            <!--Optional:-->
            <descuentoPct>?</descuentoPct>
            <!--Optional:-->
            <indAgenteResp>?</indAgenteResp>
            <indFact>?</indFact>
            <!--Zero or more repetitions:-->
            <listaWsItemRetencPercep>
               <!--Optional:-->
               <codRet>?</codRet>
               <!--Optional:-->
               <mntSujetoaRet>?</mntSujetoaRet>
               <!--Optional:-->
               <tasa>?</tasa>
               <!--Optional:-->
               <valRetPerc>?</valRetPerc>
            </listaWsItemRetencPercep>
            <montoItem>?</montoItem>
            <!--Optional:-->
            <nomItem>?</nomItem>
            <nroLinDet>?</nroLinDet>
            <!--Optional:-->
            <precioUnitario>?</precioUnitario>
            <!--Optional:-->
            <recargoMonto>?</recargoMonto>
            <!--Optional:-->
            <recargoPct>?</recargoPct>
            <!--Optional:-->
            <tipoLinEntSis>?</tipoLinEntSis>
            <!--Optional:-->
            <uniMed>?</uniMed>
         </listaWsItems>
         <!--Zero or more repetitions:-->
         <listaWsReferencias>
            <!--Optional:-->
            <fechaCFEref>?</fechaCFEref>
            <indicadorReferenciaGlobal>?</indicadorReferenciaGlobal>
            <nroCFERef>?</nroCFERef>
            <nroLinRef>?</nroLinRef>
            <!--Optional:-->
            <razonReferencia>?</razonReferencia>
            <!--Optional:-->
            <serie>?</serie>
            <!--Optional:-->
            <tpoDocRef>?</tpoDocRef>
         </listaWsReferencias>
         <!--Zero or more repetitions:-->
         <listaWsAdendas>
            <!--Optional:-->
            <etiqueta>?</etiqueta>
            <ordinal>?</ordinal>
            <!--Optional:-->
            <valor>?</valor>
         </listaWsAdendas>
         <!--Zero or more repetitions:-->
         <listaWsMediosPagos>
            <!--Optional:-->
            <codMP>?</codMP>
            <!--Optional:-->
            <glosaMP>?</glosaMP>
            <!--Optional:-->
            <nroLinMP>?</nroLinMP>
            <!--Optional:-->
            <ordenMP>?</ordenMP>
            <!--Optional:-->
            <valorPago>?</valorPago>
         </listaWsMediosPagos>
         <!--Zero or more repetitions:-->
         <listaWsRetencPercep>
            <!--Optional:-->
            <codRet>?</codRet>
            <!--Optional:-->
            <valRetPerc>?</valRetPerc>
         </listaWsRetencPercep>
         <!--Optional:-->
         <impresionImprimirSiNo>?</impresionImprimirSiNo>
         <!--Optional:-->
         <impresionImpresora>?</impresionImpresora>
         <!--Optional:-->
         <impresionFormato>?</impresionFormato>
         <impresionNumeroVias>?</impresionNumeroVias>
         <!--Optional:-->
         <simular>?</simular>
         <!--Zero or more repetitions:-->
         <emailEnvioPdf>?</emailEnvioPdf>
         <!--Optional:-->
         <emailCuerpo>?</emailCuerpo>
         <!--Zero or more repetitions:-->
         <listaWsDescuentos>
            <!--Optional:-->
            <codigo>?</codigo>
            <!--Optional:-->
            <glosa>?</glosa>
            <!--Optional:-->
            <indFact>?</indFact>
            <!--Optional:-->
            <nroLinea>?</nroLinea>
            <!--Optional:-->
            <tipo>?</tipo>
            <!--Optional:-->
            <tipoMovimiento>?</tipoMovimiento>
            <!--Optional:-->
            <valor>?</valor>
         </listaWsDescuentos>
         <!--Optional:-->
         <wsComplFiscal>
            <!--Optional:-->
            <codpais>?</codpais>
            <!--Optional:-->
            <docmdte>?</docmdte>
            <!--Optional:-->
            <nombremdte>?</nombremdte>
            <!--Optional:-->
            <rucemisor>?</rucemisor>
            <!--Optional:-->
            <tipodocmdte>?</tipodocmdte>
         </wsComplFiscal>
      </web:recepcionCFE>
   </soapenv:Body>
</soapenv:Envelope>